In [226]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [227]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv.csv', nrows = 6868)
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN
5     Afghanistan  2014  2102.385234              NaN

In [228]:
internet_df = pd.read_csv('../data/internet_use.csv.csv', nrows= 4495)

In [229]:
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

#7 Look at the shape of each DataFrame - how many rows? How many columns?

gdp_df has 6870 rows and 4 columns internet_df has 4675 rows and 4 columns

In [230]:
gdp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6868 entries, 0 to 6867
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  6868 non-null   object
 1   Year             6868 non-null   int64
 2   Value            6868 non-null   float64
 3   Value Footnotes  1 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 214.8+ KB

In [231]:
internet_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4495 entries, 0 to 4494
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  4495 non-null   object
 1   Year             4495 non-null   int64
 2   Value            4495 non-null   float64
 3   Value Footnotes  948 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 140.6+ KB

#8 Take a look at the datatypes for the columns in each DataFrame.

In [232]:
gdp_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [233]:
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

#9 Take a look at the last 10 rows of each DataFrame in turn.

In [234]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6858        Zimbabwe  1999  3600.849291              NaN
6859        Zimbabwe  1998  3653.920016              NaN
6860        Zimbabwe  1997  3580.048793              NaN
6861        Zimbabwe  1996  3520.430146              NaN
6862        Zimbabwe  1995  3226.413930              NaN
6863        Zimbabwe  1994  3263.934978              NaN
6864        Zimbabwe  1993  3033.504852              NaN
6865        Zimbabwe  1992  3054.889178              NaN
6866        Zimbabwe  1991  3426.598094              NaN
6867        Zimbabwe  1990  3324.348171              NaN

In [235]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

#10 Drop the value footnotes column from both DataFrames. Check that this worked as expected.

In [236]:
del gdp_df['Value Footnotes']
gdp_df.head()

  Country or Area  Year        Value
0     Afghanistan  2019  2065.036398
1     Afghanistan  2018  2033.779002
2     Afghanistan  2017  2058.383832
3     Afghanistan  2016  2057.062164
4     Afghanistan  2015  2068.265904

In [237]:
del internet_df['Value Footnotes']
internet_df.head()

  Country or Area  Year     Value
0     Afghanistan  2014  6.390000
1     Afghanistan  2013  5.900000
2     Afghanistan  2012  5.454545
3     Afghanistan  2011  5.000000
4     Afghanistan  2010  4.000000

#11 Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [238]:
gdp_df = gdp_df.rename(columns = {'Country or Area' : 'Country', 'Year' : 'Year', 
                         'Value' : 'GDP_Per_Capita'})
gdp_df.head()

       Country  Year  GDP_Per_Capita
0  Afghanistan  2019     2065.036398
1  Afghanistan  2018     2033.779002
2  Afghanistan  2017     2058.383832
3  Afghanistan  2016     2057.062164
4  Afghanistan  2015     2068.265904

#12 Change the columns for the Internet Users DataFrame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [239]:
internet_df = internet_df.rename(columns = {'Country or Area' : 'Country', 'Year' : 'Year',
                            'Value' : 'Internet_Users_Pct'})
internet_df.head()

       Country  Year  Internet_Users_Pct
0  Afghanistan  2014            6.390000
1  Afghanistan  2013            5.900000
2  Afghanistan  2012            5.454545
3  Afghanistan  2011            5.000000
4  Afghanistan  2010            4.000000

#13 Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. Call the new DataFrame gdp_and_internet_use.

In [240]:

gdp_and_internet_use = gdp_df.merge(internet_df, how='outer', 
                                    on=['Country','Year'])

#14 Look at the first five rows of your new DataFrame to confirm it merged correctly.

In [241]:
gdp_and_internet_use.head()

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2019     2065.036398                 NaN
1  Afghanistan  2018     2033.779002                 NaN
2  Afghanistan  2017     2058.383832                 NaN
3  Afghanistan  2016     2057.062164                 NaN
4  Afghanistan  2015     2068.265904                 NaN

#15 Look at the last five rows to make sure the data is clean and as expected.

In [242]:
gdp_and_internet_use.tail()

     Country  Year  GDP_Per_Capita  Internet_Users_Pct
7900   Yemen  1999             NaN            0.056629
7901   Yemen  1998             NaN            0.023323
7902   Yemen  1997             NaN            0.015025
7903   Yemen  1996             NaN            0.000621
7904   Yemen  1990             NaN            0.000000

#16 Subset the combined DataFrame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly.

In [243]:
gdp_and_internet_use = gdp_and_internet_use.loc[(gdp_and_internet_use['Year'] == 2004)
                                               | (gdp_and_internet_use['Year']== 2009)
                                               | (gdp_and_internet_use['Year']== 2014)]

In [244]:
gdp_and_internet_use.head(10)

        Country  Year  GDP_Per_Capita  Internet_Users_Pct
5   Afghanistan  2014     2102.385234            6.390000
10  Afghanistan  2009     1758.904043            3.550000
15  Afghanistan  2004     1200.278256            0.105809
23      Albania  2014    11623.866679           60.100000
28      Albania  2009    10346.864199           41.200000
33      Albania  2004     7604.838002            2.420388
53      Algeria  2014    11512.705405           18.090000
58      Algeria  2009    10782.361398           11.230000
63      Algeria  2004    10058.435939            4.634475
83       Angola  2014     8239.828837           21.260000

#17 Create three new DataFrames, one for 2004, one for 2009, and one for 2014. Give them meaningful names that aren't too long.

In [253]:
data = gdp_and_internet_use.loc[gdp_and_internet_use.Year == 2004]

year2004 = pd.DataFrame(data)

year2004.head(10)

                 Country  Year  GDP_Per_Capita  Internet_Users_Pct
15           Afghanistan  2004     1200.278256            0.105809
33               Albania  2004     7604.838002            2.420388
63               Algeria  2004    10058.435939            4.634475
93                Angola  2004     5593.241537            0.464815
123  Antigua and Barbuda  2004    18745.681534           24.266544
153           Arab World  2004    11742.589407                 NaN
183            Argentina  2004    18032.610491           16.036684
213              Armenia  2004     6472.131214            4.899009
241                Aruba  2004    38984.218383           23.000000
271            Australia  2004    41578.498520                 NaN